app/views/comments/_form.html.erb

<div class="comment-list">
  <% @location.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."location_id" = ?  [["location_id", 1]]