app/controllers/comments_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Nic"], ["body", "jj"], ["location_id", 1], ["created_at", "2015-02-16 22:19:14.493683"], ["updated_at", "2015-02-16 22:19:14.493683"]]
---
  def create
    # generates comment based on specific location
    @location = Location.find(params[:id])
    @comment = @location.comments.create(comment_params)