app/controllers/location_controller.rb

  def submit

    #finds or creates a location record in the database using the location parameters
    @location = Location.find_or_create_by(location_params)
---
INSERT INTO "locations" ("city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city", "san jose"], ["state", "CA"], ["created_at", "2015-02-16 22:18:58.130504"], ["updated_at", "2015-02-16 22:18:58.130504"]]